**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [200]:
import pandas as pd
import numpy as np

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
df = pd.DataFrame(data, index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
df

   age       birds priority  visits
a  3.5      Cranes      yes       2
b  4.0      Cranes      yes       4
c  1.5     plovers       no       3
d  NaN  spoonbills      yes       4
e  6.0  spoonbills       no       3
f  3.0      Cranes       no       4
g  5.5     plovers       no       2
h  NaN      Cranes      yes       2
i  8.0  spoonbills       no       3
j  4.0  spoonbills       no       2

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [109]:
#df['birds'].describe()
df.describe()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

**3. Print the first 2 rows of the birds dataframe **

In [10]:
#head() function display the preview of the birds dataframe. It will give first 5 rows.
df.head(2)

   age   birds priority  visits
a  3.5  Cranes      yes       2
b  4.0  Cranes      yes       4

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [11]:
df[['birds', 'age']]

        birds  age
a      Cranes  3.5
b      Cranes  4.0
c     plovers  1.5
d  spoonbills  NaN
e  spoonbills  6.0
f      Cranes  3.0
g     plovers  5.5
h      Cranes  NaN
i  spoonbills  8.0
j  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [21]:
df.loc[['b','c','g'], ['birds', 'age', 'visits']]
# we can also use iloc method which takes only integers.
#df.iloc[[2,3,7], [1, 0, 3]]

     birds  age  visits
b   Cranes  4.0       4
c  plovers  1.5       3
g  plovers  5.5       2

**6. select the rows where the number of visits is less than 4**

In [22]:
df[df['visits'] < 4]

   age       birds priority  visits
a  3.5      Cranes      yes       2
c  1.5     plovers       no       3
e  6.0  spoonbills       no       3
g  5.5     plovers       no       2
h  NaN      Cranes      yes       2
i  8.0  spoonbills       no       3
j  4.0  spoonbills       no       2

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [41]:
df[df['age'].isnull()][['birds', 'visits']]

        birds  visits
d  spoonbills       4
h      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [45]:
df[(df['birds'] == 'Cranes') & (df['age'] < 4)]

   age   birds priority  visits
a  3.5  Cranes      yes       2
f  3.0  Cranes       no       4

**9. Select the rows the age is between 2 and 4(inclusive)**

In [51]:
df[(df['age'] > 2) & (df['age'] <= 4)]

   age       birds priority  visits
a  3.5      Cranes      yes       2
b  4.0      Cranes      yes       4
f  3.0      Cranes       no       4
j  4.0  spoonbills       no       2

**10. Find the total number of visits of the bird Cranes**

In [69]:
df1 = df[df['birds'] == 'Cranes'].sum(axis=0)
df1['visits']

12

**11. Calculate the mean age for each different birds in dataframe.**

In [70]:
g = df.groupby('birds')
print (g. mean())

            age  visits
birds
Cranes      3.5     3.0
plovers     3.5     2.5
spoonbills  6.0     3.0

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [102]:

# appending 'k' row to dataframe.
df2 = pd.DataFrame({'birds': ['Pengvins'], 'age': [3.5], 'visits': [4], 'priority': ['yes']}, index=['k']) 
df = df.append(df2)
#print (df)

# deleting 'k' row from dataframe.
df = df.drop('k', axis=0)
print (df)

   age       birds priority  visits
a  3.5      Cranes      yes       2
b  4.0      Cranes      yes       4
c  1.5     plovers       no       3
d  NaN  spoonbills      yes       4
e  6.0  spoonbills       no       3
f  3.0      Cranes       no       4
g  5.5     plovers       no       2
h  NaN      Cranes      yes       2
i  8.0  spoonbills       no       3
j  4.0  spoonbills       no       2

**13. Find the number of each type of birds in dataframe (Counts)**

In [107]:
g = df.groupby('birds').count()
g
#for i, j in g:
#    print(i)
#    print(j)

            age  priority  visits
birds
Cranes        3         4       4
plovers       2         2       2
spoonbills    3         4       4

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [169]:
df.sort_values(["age", "visits"], axis=0, ascending=[False, True])

   age       birds priority  visits
i  8.0  spoonbills       no       3
e  6.0  spoonbills       no       3
g  5.5     plovers       no       2
j  4.0  spoonbills       no       2
b  4.0      Cranes      yes       4
a  3.5      Cranes      yes       2
f  3.0      Cranes       no       4
c  1.5     plovers       no       3
h  NaN      Cranes      yes       2
d  NaN  spoonbills      yes       4

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [170]:
df['priority'] = df['priority'].map({'yes': 1, 'no': 0})
df

   age       birds  priority  visits
a  3.5      Cranes         1       2
b  4.0      Cranes         1       4
c  1.5     plovers         0       3
d  NaN  spoonbills         1       4
e  6.0  spoonbills         0       3
f  3.0      Cranes         0       4
g  5.5     plovers         0       2
h  NaN      Cranes         1       2
i  8.0  spoonbills         0       3
j  4.0  spoonbills         0       2

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [199]:
df.replace(to_replace ="Cranes", 
                 value ="trumpeters")

   age       birds priority  visits
a  3.5  trumpeters      yes       2
b  4.0  trumpeters      yes       4
c  1.5     plovers       no       3
d  NaN  spoonbills      yes       4
e  6.0  spoonbills       no       3
f  3.0  trumpeters       no       4
g  5.5     plovers       no       2
h  NaN  trumpeters      yes       2
i  8.0  spoonbills       no       3
j  4.0  spoonbills       no       2